#导入相关库
import torch
from torch.utils.data import TensorDataset      #构建数据集对象
from torch.utils.data import DataLoader         #数据加载器
from torch import nn                            #nn中有平方根损失函数和假设函数
from torch import optim                         #optim中有优化器函数
from sklearn.datasets import make_regression    #创建模型回归类型数据集
import matplotlib.pyplot as plt

plt.rcParams['font.sans-serif'] = ['SimHei']  #用来正常显示中文标签
plt.rcParams['axes.unicode_minus'] = False #用来正常显示负号

#1.定义函数,创建线性回归样本数据
def create_dataset():
    x,y,coef = make_regression(n_samples=100, #100个样本点
                               n_features=1,  #1个特征
                               noise=10,     #10个噪声
                               coef=True,     #是否返回系数
                               random_state=3 #随机数种子
                             )
    #2.把上述数据,封装成张量对象
    x=torch.tensor(x,dtype=torch.float32)
    y=torch.tensor(y,dtype=torch.float32)
    #3.返回结果
    return x,y,coef

#2.定义函数,表示模型训练
def train(x,y,coef):
    #1.创建数据集对象，把tensor->数据集对象->数据加载器
    dataset=TensorDataset(x,y)
    #2.创建数据加载器对象
    #参一:数据集对象,参二:批次大小,参数三:是否打乱数据(训练集打乱,测试集不打乱)
    dataloader=DataLoader(dataset,batch_size=16,shuffle=True)
    #3.创建初始的线性回归模型
    #参一:输入特征数,参二:输出特征数
    model=nn.Linear(in_features=1,out_features=1)
    #4.创建损失函数对象
    criterion=nn.MSELoss()
    #5.创建优化器对象
    optimizer=optim.SGD(model.parameters(),lr=0.01)
    #6.具体的训练过程
    #6.1 定义变量，分别表示测试轮数，每轮的平均损失，训练总损失值，总样本数
    epochs,loss_list=100,[]
    #6.2 开始训练
    for epoch in range(epochs):
        # 每轮开始重置损失与计数（这是我只加的关键修复）
        total_loss,total_sample=0,0
        #6.3 每轮是分批次训练
        for train_x,train_y in dataloader:
            #6.4 模型预测
            y_pred=model(train_x)
            #6.5 计算(每轮的平均)损失值
            loss=criterion(y_pred,train_y.reshape(-1,1))
            #6.6 计算损失和样本批次数
            total_loss+=loss.item()
            total_sample+=1
            #6.7 梯度清零+反向传播+梯度更新
            optimizer.zero_grad()
            loss.backward()
            optimizer.step()
    #6.8 把每轮的平均损失添加到列表中
        loss_list.append(total_loss/total_sample)
        print(f'第{epoch+1}轮，平均损失是：{total_loss/total_sample}')
    #7.返回结果
    print(f'{epochs}轮的平均损失分别为:{loss_list}')
    print(f'模型参数,权重是：{model.weight},偏置是：{model.bias}')
    #8.绘制损失曲线
    plt.plot(range(epochs),loss_list)
    plt.title('损失曲线变化图')
    plt.grid()
    plt.show()
    #9.绘制预测结果和真实结果关系
    plt.scatter(x,y,c='r',s=10)
    plt.plot(x,model(x).detach().numpy(),c='b',linewidth=3)
    plt.title('预测结果和真实结果关系')
    plt.grid()
    plt.show()

#3.测试
if __name__ == '__main__':
    #3.1创建数据集
    x,y,coef=create_dataset()
    # print(f'系数是：{coef}')
    # print(f'x.shape:{x.shape}')
    # print(f'y.shape:{y.shape}')
    # print(f'x:{x}')
    # print(f'y:{y}')
    #3.2模型训练
    train(x,y,coef)

# 结果展示
"""
第1轮，平均损失是：877.9683925083706
第2轮，平均损失是：680.8268083844866
第3轮，平均损失是：519.2242170061384
第4轮，平均损失是：380.651846749442
第5轮，平均损失是：305.13258579799106
第6轮，平均损失是：251.40328543526786
第7轮，平均损失是：192.0957429068429
第8轮，平均损失是：160.6560570853097
第9轮，平均损失是：148.50482940673828
第10轮，平均损失是：139.65491267613
第11轮，平均损失是：109.00935418265206
第12轮，平均损失是：95.83068752288818
第13轮，平均损失是：124.80052839006696
第14轮，平均损失是：89.99293736049107
第15轮，平均损失是：83.66359111240932
第16轮，平均损失是：81.69942310878209
第17轮，平均损失是：79.02976145063128
第18轮，平均损失是：87.62755148751395
第19轮，平均损失是：81.03038787841797
第20轮，平均损失是：77.08965655735561
第21轮，平均损失是：84.07265799386161
第22轮，平均损失是：75.26969173976353
第23轮，平均损失是：77.21619469778878
第24轮，平均损失是：85.83897454398019
第25轮，平均损失是：85.49873079572406
第26轮，平均损失是：74.89257758004325
第27轮，平均损失是：83.19790213448661
第28轮，平均损失是：82.15821729387555
第29轮，平均损失是：84.24949972970145
第30轮，平均损失是：78.12199401855469
第31轮，平均损失是：83.77893175397601
第32轮，平均损失是：78.5544662475586
第33轮，平均损失是：82.64435304914203
第34轮，平均损失是：78.0586166381836
第35轮，平均损失是：79.15950611659459
第36轮，平均损失是：82.7523923601423
第37轮，平均损失是：72.66137341090611
第38轮，平均损失是：80.99666976928711
第39轮，平均损失是：94.46790259225028
第40轮，平均损失是：74.04949283599854
第41轮，平均损失是：82.49020412990025
第42轮，平均损失是：86.8809792654855
第43轮，平均损失是：87.15632738385882
第44轮，平均损失是：81.30799266270229
第45轮，平均损失是：76.07086345127651
第46轮，平均损失是：83.87283706665039
第47轮，平均损失是：82.27532795497349
第48轮，平均损失是：74.4118982042585
第49轮，平均损失是：74.50723675319126
第50轮，平均损失是：74.8289816720145
第51轮，平均损失是：75.7921164376395
第52轮，平均损失是：82.20128686087472
第53轮，平均损失是：80.90279115949359
第54轮，平均损失是：78.47725459507534
第55轮，平均损失是：96.83335386003766
第56轮，平均损失是：75.60801642281669
第57轮，平均损失是：78.19713973999023
第58轮，平均损失是：103.94749396187919
第59轮，平均损失是：75.17273548671177
第60轮，平均损失是：76.41267721993583
第61轮，平均损失是：75.8356797354562
第62轮，平均损失是：78.91982432774135
第63轮，平均损失是：74.41741289411273
第64轮，平均损失是：78.9793346949986
第65轮，平均损失是：81.93883841378349
第66轮，平均损失是：77.50106484549386
第67轮，平均损失是：74.25757816859654
第68轮，平均损失是：88.32422910417829
第69轮，平均损失是：80.7673110961914
第70轮，平均损失是：77.56924002511161
第71轮，平均损失是：75.80453654697963
第72轮，平均损失是：77.73702784946987
第73轮，平均损失是：76.0026125226702
第74轮，平均损失是：75.23005376543317
第75轮，平均损失是：75.8104613167899
第76轮，平均损失是：74.05895832606724
第77轮，平均损失是：95.54857308523995
第78轮，平均损失是：87.51977484566825
第79轮，平均损失是：77.31338609967914
第80轮，平均损失是：77.27331052507672
第81轮，平均损失是：81.61854880196708
第82轮，平均损失是：95.37474496023995
第83轮，平均损失是：82.34644372122628
第84轮，平均损失是：79.74392700195312
第85轮，平均损失是：89.08085823059082
第86轮，平均损失是：83.69599642072406
第87轮，平均损失是：78.41614532470703
第88轮，平均损失是：76.42377471923828
第89轮，平均损失是：80.46525410243443
第90轮，平均损失是：82.67661121913365
第91轮，平均损失是：75.16834967476981
第92轮，平均损失是：75.10389763968331
第93轮，平均损失是：84.61938858032227
第94轮，平均损失是：88.8721433367048
第95轮，平均损失是：73.24251638139997
第96轮，平均损失是：80.75868552071708
第97轮，平均损失是：73.92606217520577
第98轮，平均损失是：81.85509272984096
第99轮，平均损失是：73.46158627101353
第100轮，平均损失是：96.6061177934919
100轮的平均损失分别为:[877.9683925083706, 680.8268083844866, 519.2242170061384, 380.651846749442, 305.13258579799106, 251.40328543526786, 192.0957429068429, 160.6560570853097, 148.50482940673828, 139.65491267613, 109.00935418265206, 95.83068752288818, 124.80052839006696, 89.99293736049107, 83.66359111240932, 81.69942310878209, 79.02976145063128, 87.62755148751395, 81.03038787841797, 77.08965655735561, 84.07265799386161, 75.26969173976353, 77.21619469778878, 85.83897454398019, 85.49873079572406, 74.89257758004325, 83.19790213448661, 82.15821729387555, 84.24949972970145, 78.12199401855469, 83.77893175397601, 78.5544662475586, 82.64435304914203, 78.0586166381836, 79.15950611659459, 82.7523923601423, 72.66137341090611, 80.99666976928711, 94.46790259225028, 74.04949283599854, 82.49020412990025, 86.8809792654855, 87.15632738385882, 81.30799266270229, 76.07086345127651, 83.87283706665039, 82.27532795497349, 74.4118982042585, 74.50723675319126, 74.8289816720145, 75.7921164376395, 82.20128686087472, 80.90279115949359, 78.47725459507534, 96.83335386003766, 75.60801642281669, 78.19713973999023, 103.94749396187919, 75.17273548671177, 76.41267721993583, 75.8356797354562, 78.91982432774135, 74.41741289411273, 78.9793346949986, 81.93883841378349, 77.50106484549386, 74.25757816859654, 88.32422910417829, 80.7673110961914, 77.56924002511161, 75.80453654697963, 77.73702784946987, 76.0026125226702, 75.23005376543317, 75.8104613167899, 74.05895832606724, 95.54857308523995, 87.51977484566825, 77.31338609967914, 77.27331052507672, 81.61854880196708, 95.37474496023995, 82.34644372122628, 79.74392700195312, 89.08085823059082, 83.69599642072406, 78.41614532470703, 76.42377471923828, 80.46525410243443, 82.67661121913365, 75.16834967476981, 75.10389763968331, 84.61938858032227, 88.8721433367048, 73.24251638139997, 80.75868552071708, 73.92606217520577, 81.85509272984096, 73.46158627101353, 96.6061177934919]
模型参数,权重是：Parameter containing:
tensor([[27.5481]], requires_grad=True),偏置是：Parameter containing:
tensor([-0.8535], requires_grad=True)
"""